---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
source: html/2347f79c-491f-58af-e5fd-766bc98da255.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ

Defines parameters for Z Cold Formed shape.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralLZ : StructuralSectionColdFormed
```